/*
멜로/로맨스,0
코미디,1
가족,2
어드벤처,3
액션,4
스포츠,5
SF,6
범죄,7
전쟁,8
공포,9
스릴러,10
드라마,11
판타지,12
코믹,13
애니메이션,14
*/

const qnaList = [
  {
    q: '“아… 알람이 왜 안울린거야!! 늦잠 자벼렸네 ㅠㅠ”<br>중요한 약속이 있었는데 무슨 약속이었더라?? 누구랑 무슨 약속이었지??',
    a: [
      { answer: 'a. 알콩달콩 애인과의 데이트', type: [0, 1, 2] },
      { answer: 'b. 왁자지껄 친구들과 떠나는 재밌는 여행', type: [1, 3, 4] },

    ]
  },
  {
    q: '띵띵디디딩 띵띠디디딩~♬ <br>“어디야?? 약속시간 다되가는데 언제와???”<br>“금방가~~ 얼마 안걸려~~”<br>어떻게 하지?? 어떻게 해야 약속장소로 빨리 갈까??',
    a: [
      { answer: 'a. 버스기다리느라 시간 걸리고, 차도 막히고 차라리 튼튼한 내 두 다리를 믿고 뛰겠어!!', type: [5, 4] },
      { answer: 'b. 아무리 그래도 뛰는 것보다는 버스를 타거나 택시타고 가는게 빠르지 않겠어??      ', type: [6] },
     
    ]
  },
  {
    q: '우당탕탕!!<br>“누가 말려야 하는거 아니에요??”<br>중년 아주머니의 걱정된 목소리가 들린다<br>“경찰은 왜 안오는거야!!”<br>'
    + '격앙된 남자의 목소리도 들린다.<br>' + "'무슨 일이지??'<br>"+ ' 궁금증이 생긴 나는 가던길을 멈추고 들여다 보았다',
    a: [
      { answer: 'a. 원투펀치!!! 옆차기!! 뒤돌려차기!! 두 남자가 상대방을 죽일듯이 싸우고 있다!!', type: [4] },
      { answer: 'b. 세상에!! 옆건물 태권도장이랑 앞건물 합기도장 단원들이 단체로 싸우고 있다니…', type: [7, 8] },
    ]
  },
  {
    q: '친구들과 기분좋게 한 잔 마시고 늦은 밤 집에 가고 있다..<br>'+ 
    "‘골목길이 어둡고 무섭지만 집으로 가는 지름길이니까 골목길로 가야겠다’<br>"+
    '터벅 터벅<br>물컹…<br>'+ "‘이게 뭐지…. 발 밑에 뭔가 물컹한 것을 밟았는데…’<br>"+
     '공포심이 가득한 눈으로 밑을 본 당신..<br>' + "‘헉.. 이게 뭐지??’",
    a: [
      { answer: 'a. 누군가의 시체 ', type: [9, 10 ] },
      { answer: 'b. 커다란 곰 인형 ', type: [13, 3, 2 ] },
     
    ]
  },
  {
    q: '“으악!!”<br>'+ '늦은 밤 집으로 돌아가던 당신은 시체를 발견했다.<br>'+
    ' 경찰에 신고를 하고 조사를 마친 후 집으로 가는데…',
    a: [
      { answer: 'a. 끔찍하다.. 생각하고 싶지 않다.. 술먹고 다 잊어야지', type: [11, 12 ] },
      { answer: 'b. 누가 범인일까?? 어떻게 죽은거지?? 호기심이 일어난다.', type: [10, 9, 7]},
     
    ]
  },

  {
    q: '한 주 동안 열심히 일한 당신… 이번주에는 안좋은 일도 많았다..<br>'+
       '답답한 마음을 덜어내고자 겨울 바다로 떠난 당신<br>'+
       '바다에 도착하고 탁 트인 바다를 바라보는데',
    a: [
      { answer: 'a. 바다에 큰 파도가 출렁거리고 시원한 바람이 세차게 불고 있다', type: [4, 6 ] },
      { answer: 'b. 잔잔한 바다.. 저멀리 노을이 지고 있다', type: [2, 11, 0 ] },
  
    ]
  },
  {
    q: '우우웅~ 웅~ 우웅~<br>'+
       "‘음.. 이게 무슨 소리지??’<br>"+
       "이상한 소리에 잠에서 깬 당신..<br>"+
       "당신의 눈앞에 끝을 알 수없는 블랙홀 같은 공간이 생겼다",
    a: [
      { answer: 'a. 이게 뭘까?? 호기심이 가득해진 당신', type: [12, 6, 3 ] },
      { answer: 'b. 세상에 이딴게 어딨어… 내가 잠이 덜 깼나보군.. 다시 자야지..', type: [11, 0, 2 ] },
    ]
  },
  {
    q: '오랜만에 갖게 된 휴일~<br>'+
    '오늘 뭐 하면서 시간을 보낼까??',
    a: [
      { answer: 'a. 집에서 재밌는거나 보면서 휴식하자', type: [0, 11, 13, 14 ] },
      { answer: 'b. 오랜만에 밖으로 나가서 취미 활동 좀 해볼까??', type: [5, 6, 7 ] },
    ]
  },
  {
    q: '9. 연인에게 하루종일 연락이 안 온다..',
    a: [
      { answer: 'a. 뭐.. 언젠가 연락 오겠지. 내가 할 일 하며 기다린다', type: [7, 0, 5, 9 ] },
      { answer: 'b. 초조해서 마음 졸이며 인스타, 페북, 카톡 등 모든 SNS 다 들어가본다.', type: [1, 3, 6, 11 ] },
      { answer: 'c. 연인에게 연락 올 때까지 무한 카톡, 무한 전화', type: [2, 10, 8, 4 ] },
    ]
  },
  {
    q: '10. 연인이 연락도 없이 보고싶다고 우리집 앞에 와서 기다린다. ',
    a: [
      { answer: 'a. 아니 갑자기 오면 어떡해.. 하 나 준비도 안 했는데 왜 와. 짜증나네', type: [4, 9, 11] },
      { answer: 'b. 아 그래?? 나 할 것들 좀만 마무리하고 나갈게', type: [0, 2, 6, 5 ] },
      { answer: 'c. 헐 대박, 어디야?? 당장 나갈게!', type: [1, 7, 3, 10, 8 ] },
    ]
  },
  {
    q: '11. 내가 추구하는 연애관은? ',
    a: [
      { answer: 'a. 각자 할 것 하며, 평안하고 안정적인 연애가 좋다.', type: [1, 4, 9, 11 ] },
      { answer: 'b. 보고싶을 때 보고, 데이트도 많이 하고 꽁냥꽁냥하는 연애가 좋아.', type: [7, 0, 3, 6, 10] },
      { answer: 'c. 연애는 마음가는대로! 불타오르는 연애가 최고지.', type: [2, 5, 8 ] },
    ]
  },
  {
    q: '12. 연인과 데이트 도중 화를 참을 수 없을만큼 심하게 싸웠다. 어떻게 할 것인가?',
    a: [
      { answer: 'a. "아 화나네. 따라오지마 오늘 집 갈 거니까." 라고 말하며 집으로 간다.', type: [3, 6, 4, 9 ] },
      { answer: 'b. "야! 너 화내지마. 너 잘못이지. 내가 뭘 잘못했는데?" 소리지르며 끝까지 불같이 화낸다.', type: [0, 2, 5, 10, 8] },
      { answer: 'c. "아니 그건 아니고, 하.." 조용히 운다.', type: [1, 7, 11] },
    ]
  }
]

const infoList = [
 
]
const randomArray = qnaList.sort(() => 0.5 - Math.random());
const [randomValue] = randomArray;